// © Copyright 2005, 2015 HP Development Company, L.P.

TaskName = "Control Panel Language";

English = "English";
French = "French";
German = "German";
Spanish = "Spanish";
Italian = "Italian";
Swedish = "Swedish";
Danish = "Danish";
Norwegian = "Norwegian";
Dutch = "Dutch";
Finnish = "Finnish";
Japanese = "Japanese";
Portuguese = "Portuguese";
Polish = "Polish";
Turkish = "Turkish";
Kanji = "Kanji";
TradChinese = "TradChinese";
SimpChinese = "SimpChinese";
Russian = "Russian";
Czech = "Czech";
Hungarian = "Hungarian";
Korean = "Korean";
Thai = "Thai";
Hebrew = "Hebrew";
EastEuropean = "EastEuropean";
EuroEnglish = "EuroEnglish";
CanadianFrench = "CanadianFrench";
Greek = "Greek";
Arabic = "Arabic";
IndonesianBahasa = "IndonesianBahasa";
Bulgarian = "Bulgarian";
Croatian = "Croatian";
Estonian = "Estonian";
Latvian = "Latvian";
Lithuanian = "Lithuanian";
Romanian = "Romanian";
Slovakian = "Slovakian";
Slovenian = "Slovenian";
Ukrainian = "Ukrainian";
Malay = "Malay";

TaskDescription = "To change the language used for displaying information on the control panel and printing device reports (such as the configuration page), select a language from list below:";
LanguageLabel = "Language:";
ApplyButtonTitle = "Apply Now";
NoLangSelected = "Select a Language";

NoCountrySelected = "Select a Country/Region";
CountryLabel = "Country/Region:";

// country names
afghanistan = "Afghanistan";
albania = "Albania";
algeria = "Algeria";
americanSamoa = "American Samoa";
andorra = "Andorra";
angola = "Angola";
anguilla = "Anguilla";
antiguaAndBarbuda = "Antigua and Barbuda";
argentina = "Argentina";
armenia = "Armenia";
aruba = "Aruba";
ascensionIsland = "ascensionIsland";
australia = "Australia";
austria = "Austria";
azerbaijan = "Azerbaijan";
bahamasThe = "Bahamas";
bahrain = "Bahrain";
bangladesh = "Bangladesh";
barbados = "Barbados";
belarus = "Belarus";
belgium = "Belgium";
belize = "Belize";
benin = "Benin";
bermuda = "Bermuda";
bhutan = "Bhutan";
bolivia = "Bolivia";
bosniaAndHerzegovina = "Bosnia and Herzegovina";
botswana = "Botswana";
brazil = "Brazil";
brunei = "Brunei";
bulgaria = "Bulgaria";
burkinaFaso = "Burkina Faso";
burundi = "Burundi";
cambodia = "Cambodia";
cameroon = "Cameroon";
canada = "Canada";
capeVerde = "Cape Verde";
caymanIslands = "Cayman Islands";
centralAfricanRepublic = "Central African Republic";
chad = "Chad";
chile = "Chile";
china = "China";
cocosKeelingIslands = "cocosKeelingIslands";
colombia = "Colombia";
comoros = "Comoros";
congo = "Congo";
congoDRC = "Congo, Democratic Republic of the";
cookIslands = "Cook Islands";
costaRica = "Costa Rica";
croatia = "Croatia";
cuba = "Cuba";
cyprus = "Cyprus";
czechRepublic = "Czech Republic";
denmark = "Denmark";
diegoGarcia = "diegoGarcia";
djibouti = "Djibouti";
dominica = "Dominica";
dominicanRepublic = "Dominican Republic";
ecuador = "Ecuador";
egypt = "Egypt";
elSalvador = "El Salvador";
equatorialGuinea = "Equatorial Guinea";
eritrea = "Eritrea";
estonia = "Estonia";
ethiopia = "Ethiopia";
falklandIslandsIslasMalvinas = "Falkland Islands";
faroeIslands = "Faeroe Islands";
fijiIslands = "fijiIslands";
finland = "Finland";
france = "France";
frenchAntilles = "French Antilles";
frenchGuiana = "French Guiana";
frenchPolynesia = "French Polynesia";
gabon = "Gabon";
gambiaThe = "Gambia";
georgia = "Georgia";
germany = "Germany";
ghana = "Ghana";
gibraltar = "Gibraltar";
greece = "Greece";
greenland = "Greenland";
grenada = "Grenada";
guadeloupe = "Guadeloupe";
guam = "Guam";
guantanamoBay = "guantanamoBay";
guatemala = "Guatemala";
guinea = "Guinea";
guineaBissau = "Guinea-Bissau";
guyana = "Guyana";
haiti = "Haiti";
honduras = "Honduras";
hongKongSAR = "Hong Kong S.A.R";
hungary = "Hungary";
iceland = "Iceland";
india = "India";
indonesia = "Indonesia";
iran = "Iran";
iraq = "Iraq";
ireland = "Ireland";
israel = "Israel";
italy = "Italy";
jamaica = "Jamaica";
japan = "Japan";
jordan = "Jordan";
kazakhstan = "Kazakhstan";
kenya = "Kenya";
kiribati = "Kiribati";
korea = "Korea, South";
kuwait = "Kuwait";
kyrgyzstan = "Kyrgyzstan";
laos = "Laos";
latvia = "Latvia";
lebanon = "Lebanon";
lesotho = "Lesotho";
liberia = "Liberia";
libya = "Libya";
liechtenstein = "Liechtenstein";
lithuania = "Lithuania";
luxembourg = "Luxembourg";
lacaoSAR = "lacaoSAR";
macedonia = "Macedonia";
madagascar = "Madagascar";
malawi = "Malawi";
malaysia = "Malaysia";
maldives = "Maldives";
mali = "Mali";
malta = "Malta";
marshallIslands = "Marshall Islands";
martinique = "Martinique";
mauritania = "Mauritania";
mauritius = "Mauritius";
mayotte = "Mayotte";
mexico = "Mexico";
micronesia = "Micronesia";
moldova = "Moldova";
monaco = "Monaco";
mongolia = "Mongolia";
montserrat = "Montserrat";
morocco = "Morocco";
mozambique = "Mozambique";
myanmar = "Myanmar";
namibia = "Namibia";
nauru = "Nauru";
nepal = "Nepal";
netherlandsAntilles = "Netherlands Antilles";
netherlandsThe = "Netherlands";
newCaledonia = "New Caledonia";
newZealand = "New Zealand";
nicaragua = "Nicaragua";
niger = "Niger";
nigeria = "Nigeria";
niue = "Niue";
norfolkIsland = "norfolkIsland";
northKorea = "Korea, North";
norway = "Norway";
oman = "Oman";
pakistan = "Pakistan";
palau = "Palau";
panama = "Panama";
papuaNewGuinea = "Papua New Guinea";
paraguay = "Paraguay";
peru = "Peru";
philippines = "Philippines";
poland = "Poland";
portugal = "Portugal";
puertoRico = "Puerto Rico";
qatar = "Qatar";
reunion = "Réunion";
romania = "Romania";
russia = "Russia";
rwanda = "Rwanda";
samoa = "Samoa";
sanMarino = "San Marino";
saudiArabia = "Saudi Arabia";
senegal = "Senegal";
serbiaAndMontenegro = "Serbia and Montenegro";
seychelles = "Seychelles";
sierraLeone = "Sierra Leone";
singapore = "Singapore";
slovakia = "Slovakia";
slovenia = "Slovenia";
solomonIslands = "Solomon Islands";
somalia = "Somalia";
southAfrica = "South Africa";
spain = "Spain";
sriLanka = "Sri Lanka";
stHelena = "St. Helena";
stKittsAndNevis = "St. Kitts and Nevis";
stLucia = "St. Lucia";
stPierreAndMiquelon = "St. Pierre and Miquelon";
stVincentAndTheGrenadines = "St. Vincent and the Grenadines";
sudan = "Sudan";
suriname = "Suriname";
swaziland = "Swaziland";
sweden = "Sweden";
switzerland = "Switzerland";
syria = "Syria";
taiwan = "Taiwan, China";
tajikistan = "Tajikistan";
tanzania = "Tanzania";
thailand = "Thailand";
timorLeste = "timorLeste";
togo = "Togo";
tokelau = "Tokelau";
tonga = "Tonga";
trinidadAndTobago = "Trinidad and Tobago";
tunisia = "Tunisia";
turkey = "Turkey";
turkmenistan = "Turkmenistan";
turksAndCaicosIslands = "Turks and Caicos Islands";
tuvalu = "Tuvalu";
uganda = "Uganda";
ukraine = "Ukraine";
unitedArabEmirates = "United Arab Emirates";
unitedKingdom = "United Kingdom";
unitedStates = "United States";
uruguay = "Uruguay";
uzbekistan = "Uzbekistan";
vanuatu = "Vanuatu";
vaticanCity = "Vatican City";
venezuela = "Venezuela";
vietnam = "Vietnam";
virginIslands = "Virgin Islands";
virginIslandsBritish = "British Virgin Islands";
wallisAndFutuna = "Wallis and Futuna";
yemen = "Yemen";
zambia = "Zambia";
zimbabwe = "Zimbabwe";

// region names
"africa" = "Africa";
"asiaPacific" = "Asia Pacific";
"caribbean" = "Caribbean";
"europe" = "Europe";
"indiaChina" = "India or China";
"japanCISMEA" = "Japan CISMEA";
"latinAmerica" = "Latin America";
"middleEast" = "Middle East";
"NALAAP" = "NALAAP";
"nordic" = "Nordic";
"northAfrica" = "North Africa";
"northAmericaUSACanada" = "North America (USA, Canada)";
"northWestAfrica" = "North-West Africa";
"notSupported" = "not supported";
"southernAfrica" = "Southern Africa";
"universal" = "universal";

